print("Участок == Путь S (км) == Скорость V (км/ч)\n1       ==    100      ==     50\n2       ==    200      "
      "==     80\n===========================================")
print("Условия задачи: 1.Найти времена (1,2)\n2.Найти общий путь\n3.Найти общее время\n4.Найти среднюю скорость пройденного пути\n5.Найти среднее арифмитическое скорости\n===========================================")
print("Ответы:\n=======")
s1 = 100
v1 = 50
v2 = 80
s2 = 200
time1 = s1 / v1
time2 = s2 / v2
totalpath = s1 + s2
totaltime = time1 + time2
midspeedallpath = totalpath / totaltime
midspeedarifmetic = (v1 + v2) / 2
print(f"время(1): {time1}")
print(f"время(2): {time2}")
print(f"общий путь: {totalpath}")
print(f"общее время: {totaltime}")
print(f"средняя скорость пройденного пути: {midspeedallpath}")
print(f"среднее арифметическое скорости: {midspeedarifmetic}\n====================================================")



